/* Data for the 'nom.s_document_template_fields' table  (Records 1 - 14) */

INSERT INTO nom.s_document_template_fields ("key", "description")
VALUES 
  (E'APPLICANT_EGN_LNCH', E'Идентификатор на физическо лице - заявител'),
  (E'APPLICANT_PERSON_NAME', E'Име, презиме, фамилия на физическо лице - заявител'),
  (E'BLANK', E'Празно поле за попълване'),
  (E'COMPANY_NAME', E'Наименование на търговец/ЮЛНЦ или друго юридическо лице, на което е партидата'),
  (E'CURRENT_DATE', E'Текуща дата на подаване на декларация'),
  (E'EIK_BULSTAT_PIK', E'Идентификатор на търговец/ЮЛНЦ или друго юридическо лице, на което е партидата'),
  (E'FOUNDER_NAME', E'Име, презиме, фамилия на физическо лице или наименование на фирма/ЮЛНЦ и правна форма - учредител'),
  (E'LEGAL_FORM', E'Правна форма на търговец/ЮЛНЦ или друго юридическо лице, на което е партидата'),
  (E'MCC_PERSON_NAME', E'Име, презиме, фамилия на физическо лице - член на проверителна комисия'),
  (E'MNG_ADDRESS', E'Седалище и адрес на управление'),
  (E'MNG_PERSON_NAME', E'Име, презиме, фамилия на физическо лице - управител'),
  (E'NRA_CORRESPONDENCE_ADDRESS', E'Адрес за кореспонденция с НАП'),
  (E'PARTNER_NАМЕ', E'Име, презиме, фамилия на физическо лице или наименование на фирма/ЮЛНЦ и правна форма - съдружник'),
  (E'PERMANENT_ADDRESS', E'Постоянен адрес'),
  (E'PARTNER_EGN_LNCH', E'Индентификатор на на физическо лице или наименование на фирма/ЮЛНЦ и правна форма – Съдружник'),
  (E'MNG_EGN_LNCH', E'Индентификатор на физическо лице - управител'),
  (E'MBT_EGN_LNCH', E'Идентификатор на физическо лице -  член на настоятелство на читалище'),
  (E'MBT_PERSON_NAME', E'Име,презиме,фамилия на физическо лице - член на настоятелство на читалище'),
  (E'MCC_EGN_LNCH', E'Идентификатор на физическо лице - член на проверителна комисия'),
  (E'SECRETARY_EGN_LNCH', E'Идентификатор на физическо лице - секретар на читалище'),
  (E'SECRETARY_PERSON_NAME', E'Име,презиме,фамилия на физическо лице - секретар на читалище');

  