/* Data for the 'public.n_s_functionalities' table  (Records 1 - 5) */

INSERT INTO public.n_s_functionalities ("functionality_id", "module_id", "name", "description", "created_by", "created_on", "updated_by", "updated_on")
VALUES 
  (1, 1, E'Одит', E'Одит', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (2, 1, E'Заявления', E'Подаване на заявления', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (3, 1, E'Плащания', E'Плащания', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (4, 1, E'Публични справки', E'Публични справки', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (5, 1, E'Потребители', E'Потребители', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (6, 1, E'Услуги', E'Услуги', 1, E'2018-10-04 11:00:00+03', 1, E'2018-10-04 11:00:00+03'),
  (7, 1, E'Съдържание', E'Съдържание', 1, E'2018-10-04 11:00:00+03', 1, E'2018-10-04 11:00:00+03'),
  (8, 1, E'Интеграция в ЕПЗЕУ', E'Интеграция в ЕПЗЕУ', 1, E'2018-10-04 11:00:00+03', 1, E'2018-10-04 11:00:00+03'),
  (9, 1, E'Система', E'Система', 1, E'2018-10-04 11:00:00+03', 1, E'2018-10-04 11:00:00+03'),
  (10, 2, E'Интеграция в ТРРЮЛНЦ', E'Интеграция в ТРРЮЛНЦ', 1, E'2018-10-04 11:00:00+03', 1, E'2018-10-04 11:00:00+03'),
  (12, 3, E'Интеграция в ИР', E'Интеграция в ИР', 1, E'2018-10-08 11:00:00+03', 1, E'2018-10-08 11:00:00+03');


INSERT INTO public.n_s_functionalities ("functionality_id", "module_id", "name", "description", "created_by", "created_on", "updated_by", "updated_on")
VALUES 
  (13, 1, E'Електронна поща', E'Функционалност за изпращане на съобщения по електронна поща', 1, E'2018-10-15 11:00:00+03', 1, E'2018-10-15 11:00:00+03');

INSERT INTO public.n_s_functionalities ("functionality_id", "module_id", "name", "description", "created_by", "created_on", "updated_by", "updated_on")
VALUES 
  (14, 1, E'Подписване', E'Подписване', 1, E'2019-03-13 10:06:13.757646+02', 1, E'2019-03-13 10:06:13.757646+02');