package bg.registryagency.epzeu.pr.domain.repository;

import bg.registryagency.epzeu.pr.domain.model.User;

/**
 * Интерфейс за поддържане и съхранение на обекти от тип User.
 */
public interface UserRepository {
    /**
     * Задава текущия потребител в базата данни, който отговаря за текущата сесия към базата данни.
     * Задаването на текущ потребител се използва, за да може бата данни автоматично да попълва одитни данни свързани с действията на потребителя от страна на базата.
     * @param userId идентификационен номер на потребител.
     */
    void setCurrentUser(Integer userId);

    /**
     * Осигурява идентификационен номер на потребител за работа със системата.
     * Създава потребител ако е нов за портала на имотен регистър или връща вече създаден потребител с идентификационен номер на потребителя отговарящ
     * на портала на имотен регистър.
     * @param user потребителя, за който трябва да се върне или създаде нов идентификационен номер.
     * @return потребител с идентификационен номер отговарящ на портала на имотен регистър.
     */
    User ensureUser(User user);

    User searchUser(Integer userId, Integer cin);
}
