/* Data for the 'audit.n_s_object_types' table  (Records 1 - 7) */

INSERT INTO audit.n_s_object_types ("object_type_id", "name", "description", "created_by", "created_on", "updated_by", "updated_on")
VALUES 
  (1, E'EAUApplication', E'Заявление за ЕАУ', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (2, E'UserRegistrationRequest', E'Заявка за регистрация на потребител', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (3, E'TRRULNCBatch', E'Партида в ТРРЮЛНЦ', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (4, E'UserProfile', E'Потребителски профил', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (5, E'Permission', E'Права за достъп', 1, E'2018-08-01 11:12:42.53151+03', 1, E'2018-08-01 11:12:42.536585+03'),
  (6, E'SpecialAccessRequest ', E'Заявка за специален достъп', 1, E'2018-08-01 11:13:27.851138+03', 1, E'2018-08-01 11:13:27.853697+03'),
  (7, E'UserCertificate', E'Средство за автентикация', 1, E'2019-01-14 18:13:01.375694+02', 1, E'2019-01-14 18:13:01.381099+02');
  (8, E'FileContent', E'Файлово съдържание', 1, E'2019-01-14 18:13:01.375694+02', 1, E'2019-01-14 18:13:01.381099+02');