/* Data for the 'audit.n_s_action_types' table  (Records 1 - 11) */

INSERT INTO audit.n_s_action_types ("action_type_id", "name", "description", "created_by", "created_on", "updated_by", "updated_on")
VALUES 
  (1, E'Submission', E'Подаване', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (2, E'Preview', E'Преглед', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (3, E'Edit', E'Редакция', 1, E'2018-06-12 11:00:00+03', 1, E'2018-06-12 11:00:00+03'),
  (4, E'Registration', E'Регистрация', 1, E'2018-08-01 11:14:35.022+03', 1, E'2018-08-01 11:14:35.027753+03'),
  (5, E'Approval', E'Одобряване', 1, E'2018-08-01 11:15:31.058838+03', 1, E'2018-08-01 11:15:31.06119+03'),
  (6, E'Rejection', E'Отхвърляне', 1, E'2018-08-01 11:15:57.210389+03', 1, E'2018-08-01 11:15:57.212986+03'),
  (7, E'AttachDocument', E'Прикачане на документ', 1, E'2018-08-01 11:16:20.370383+03', 1, E'2018-08-01 11:16:20.373073+03'),
  (8, E'Confirmation', E'Потвърждаване', 1, E'2018-08-01 17:23:23.228338+03', 1, E'2018-08-01 17:23:23.233758+03'),
  (9, E'Login', E'Логин', 1, E'2018-08-22 09:24:14.274313+03', 1, E'2018-08-22 09:24:14.274313+03'),
  (10, E'Add', E'Добавяне', 1, E'2019-01-14 18:07:21.362775+02', 1, E'2019-01-14 18:07:21.367703+02'),
  (11, E'Delete', E'Изтриване', 1, E'2019-01-14 18:07:50.353965+02', 1, E'2019-01-14 18:07:50.356316+02');
  (12, E'Download', E'Изтегляне', 1, E'2019-01-14 18:07:50.353965+02', 1, E'2019-01-14 18:07:50.356316+02');
  (13, E'LoadDataForChange', E'Зареждане на данни при подаване на заявление за промяна на обстоятелства в ТР', 1, E'2019-01-14 18:07:50.353965+02', 1, E'2019-01-14 18:07:50.356316+02');