using EPZEU.Utilities;
using System;

namespace EPZEU.Users.Models
{
    /// <summary>
    /// Видове права на потребители.:
    /// 6 = Издаване на удостоверение за имот - безплатен достъп; 7 = Издаване на удостоверение за лице - безплатен достъп; 8 = Издаване на удостоверение за период за лице - безплатен достъп;
    /// 9 = Издаване на заверен препис - безплатен достъп; 10 = Справка чрез отдалечен достъп за документ от ИР - безплатен достъп; 11 = Подаване на заявление за вписване на нотариален акт;
    /// 12 = Деклариране на предстояща сделка; 13 = Номенклатури и системни параметри; 14 = Администриране на потребители; 18 = Поддържане на съдържание на ЕПЗЕУ; 19 = Одит;
    /// 20 = Привилегирован одит; 21 = Администратор на лимити; 22 = Администриране на новини; 23 = Преглед на непубликувано съдържание; 24 = Администриране на статистики;
    /// 25 = Предоставяне на заверен препис от ИР на длъжностно лице; 26 = Преглед на регистрирани потребители на ЕПЗЕУ; 30 = Издаване на незаверен препис от ИР - безплатен достъп;
    /// 31 = Справка чрез отдалечен достъп за лице от ИР за избрана СВ - безплатен достъп; 32 = Справка чрез отдалечен достъп за имот от ИР - безплатен достъп;
    /// 33 = Справка чрез отдалечен достъп за електронна партида на имот от ИР - безплатен достъп; 34 = Справка чрез отдалечен достъп за лице от ИР за всички СВ - безплатен достъп;
    /// 35 = Справки по ИР за администратори; 36 = Одит за разследващи органи; 37 =  Справки по ИР за разследващи органи; 38 = Администриране на модул Плащания;
    /// 39 = Усвояване на платени суми по задължения; 40 = Корекция и анулиране на задължения; 41 = Възстановяване на суми; 42 = Издаване на удостоверение за период за имот- безплатен достъп;
    /// 43 = Администратор на ИК (Интеграция БРИС); 44 = Одитор на ИК (Интеграция БРИС);
    /// </summary>
    public enum UserPermissions
    {
        /// <summary>
        /// Издаване на удостоверение за имот - безплатен достъп
        /// </summary>
        PR_APP_UVT_PROPERTY_FREE = 6,

        /// <summary>
        /// Издаване на удостоверение за лице - безплатен достъп
        /// </summary>
        PR_APP_UVT_PERSON_FREE = 7,

        /// <summary>
        /// Издаване на удостоверение за период за лице - безплатен достъп
        /// </summary>
        PR_APP_UVT_PERIOD_PERSON_FREE = 8,

        /// <summary>
        /// Издаване на заверен препис - безплатен достъп
        /// </summary>
        PR_APP_CERTCOPY_FREE = 9,

        /// <summary>
        /// Справка чрез отдалечен достъп за документ от ИР - безплатен достъп
        /// </summary>
        PR_APP_DOCUMENT_REPORT_FREE = 10,

        /// <summary>
        /// Подаване на заявление за вписване на нотариален акт
        /// </summary>
        PR_APP_DEED_REGISTER = 11,

        /// <summary>
        /// Деклариране на предстояща сделка
        /// </summary>
        PR_APP_FUT_DEAL_DECL = 12,

        /// <summary>
        /// Номенклатури и системни параметри
        /// </summary>
        EP_ADM_NOM_PARAMS = 13,

        /// <summary>
        /// Администриране на потребители
        /// </summary>
        EP_ADM_USERS = 14,

        /// <summary>
        /// Поддържане на съдържание на ЕПЗЕУ
        /// </summary>
        EP_ADM_CMS = 18,

        /// <summary>
        /// Одит
        /// </summary>
        EP_AUDIT = 19,

        /// <summary>
        /// Привилегирован одит
        /// </summary>
        EP_PRIV_AUDIT = 20,

        /// <summary>
        /// Администратор на лимити
        /// </summary>
        EP_ADM_LIMITS = 21,

        /// <summary>
        /// Администриране на новини
        /// </summary>
        EP_ADM_NEWS = 22,

        /// <summary>
        /// Преглед на непубликувано съдържание
        /// </summary>
        EP_PREVIEW_CMS = 23,

        /// <summary>
        /// Администриране на статистики
        /// </summary>
        EP_ADM_STATISTICS = 24,

        /// <summary>
        /// Предоставяне на заверен препис от ИР на длъжностно лице
        /// </summary>
        PR_APP_PROVIDE_CERTCOPY_TO_OFFICIAL = 25,

        /// <summary>
        /// Преглед на регистрирани потребители на ЕПЗЕУ
        /// </summary>
        EP_PREVIEW_USERS = 26,

        /// <summary>
        /// Издаване на незаверен препис от ИР - безплатен достъп
        /// </summary>
        PR_APP_UNCERTCOPY_FREE = 30,

        /// <summary>
        /// Справка чрез отдалечен достъп за лице от ИР за избрана СВ - безплатен достъп
        /// </summary>
        PR_APP_PERSON_REPORT_FOR_SELECTED_SERVICE_FREE = 31,

        /// <summary>
        /// Справка чрез отдалечен достъп за имот от ИР - безплатен достъп
        /// </summary>
        PR_APP_PROPERTY_REPORT_FREE = 32,

        /// <summary>
        /// Справка чрез отдалечен достъп за електронна партида на имот от ИР - безплатен достъп
        /// </summary>
        PR_APP_PROPERTY_LOT_REPORT_FREE = 33,

        /// <summary>
        /// Справка чрез отдалечен достъп за лице от ИР за всички СВ - безплатен достъп
        /// </summary>
        PR_APP_PERSON_REPORT_FOR_ALL_SERVICES_REPORT_FREE = 34,

        /// <summary>
        /// Справки по ИР за администратори
        /// </summary>
        PR_APP_ADMIN_REPORTS = 35,

        /// <summary>
        /// Одит за разследващи органи
        /// </summary>
        EP_AUDIT_INVESTIGATING_AUTHORITIES = 36,

        /// <summary>
        /// Справки по ИР за разследващи органи
        /// </summary>
        PR_REPORTS_INVESTIGATING_AUTHORITIES = 37,

        /// <summary>
        /// Администриране на модул Плащания
        /// </summary>
        EP_ADM_PAYMENTS_L = 38,

        /// <summary>
        /// Усвояване на платени суми по задължения
        /// </summary>
        EP_DRAWN_PAID_AMOUNT_DUTY_L = 39,

        /// <summary>
        /// Корекция и анулиране на задължения
        /// </summary>
        EP_CORRECTION_CANCELLATION_DUTY_L = 40,

        /// <summary>
        /// Възстановяване на суми
        /// </summary>
        EP_RESTORE_AMOUNT_L = 41,

        /// <summary>
        /// Издаване на удостоверение за период за имот- безплатен достъп
        /// </summary>
        PR_APP_UVT_PERIOD_PROPERTY_FREE = 42,

        /// <summary>
        /// Администратор на ИК (Интеграция БРИС)
        /// </summary>
        BRIS_ADMIN_IK = 43,

        /// <summary>
        /// Одитор на ИК (Интеграция БРИС)
        /// </summary>
        BRIS_ODITOR_IK = 44
    }

    /// <summary>
    /// Права на потребители
    /// </summary>
    public class UserPermission
    {
        /// <summary>
        /// Уникален идентификатор на потребителски профил.
        /// </summary>
        [DapperColumn("user_id")]
        public int? UserID { get; set; }

        /// <summary>
        /// Уникален идентификатор на право.
        /// </summary>
        [DapperColumn("permission_id")]
        public int? PermissionID { get; set; }

        /// <summary>
        /// Право.
        /// </summary>
        public UserPermissions? Permission
        {
            get
            {
                if (Enum.TryParse(PermissionID?.ToString(), out UserPermissions tmp))
                    return tmp;

                return null;
            }
        }
    }
}
